[
  {
    "question": "What is 'Rizz'? How to pronounce it and when to use it?",
    "term": "Rizz",
    "meaning": "Charisma or charm, especially in romantic contexts",
    "usage": "Used when someone has game or can attract people easily",
    "example": "Bro has mad rizz, he got her number in 2 minutes!",
    "origin": "Short for 'charisma', popularized by Kai Cenat"
  },
  {
    "question": "What is 'Delulu'? How to pronounce it and when to use it?",
    "term": "Delulu",
    "meaning": "Delusional, living in fantasy",
    "usage": "When someone has unrealistic expectations or beliefs",
    "example": "Thinking your crush likes you back when they left you on read? That's delulu.",
    "origin": "Shortened form of 'delusional', from K-pop fan culture"
  },
  {
    "question": "What is 'Skibidi'? How to pronounce it and when to use it?",
    "term": "Skibidi",
    "meaning": "Nonsense word from viral videos; means nothing but sounds funny",
    "usage": "Used ironically or to reference Gen Alpha humor",
    "example": "Only in Ohio, skibidi toilet rizz 💀",
    "origin": "Skibidi Toilet series on YouTube"
  },
  {
    "question": "What is 'NPC'? How to pronounce it and when to use it?",
    "term": "NPC",
    "meaning": "Non-playable character; someone who acts without thinking or follows trends blindly",
    "usage": "When someone acts robotic or has no original thoughts",
    "example": "He just repeats what everyone else says like an NPC.",
    "origin": "Gaming term (Non-Playable Character)"
  },
  {
    "question": "What is 'Slay'? How to pronounce it and when to use it?",
    "term": "Slay",
    "meaning": "To do something exceptionally well; to kill it",
    "usage": "Complimenting someone's achievement, outfit, or performance",
    "example": "You absolutely slayed that presentation!",
    "origin": "LGBTQ+ ballroom culture, popularized by drag queens"
  },
  {
    "question": "What is 'Bussin'? How to pronounce it and when to use it?",
    "term": "Bussin",
    "meaning": "Really good, especially referring to food",
    "usage": "When something (usually food) is extremely tasty or of high quality",
    "example": "This pizza is bussin, no cap!",
    "origin": "AAVE (African American Vernacular English)"
  },
  {
    "question": "What is 'No cap'? How to pronounce it and when to use it?",
    "term": "No cap",
    "meaning": "No lie, for real, I'm being serious",
    "usage": "To emphasize that you're telling the truth",
    "example": "That exam was the hardest thing ever, no cap.",
    "origin": "AAVE, 'cap' means lie, so 'no cap' means 'no lie'"
  },
  {
    "question": "What is 'Fr fr'? How to pronounce it and when to use it?",
    "term": "Fr fr",
    "meaning": "For real, for real; emphasizing truth or agreement",
    "usage": "Double emphasis to show you really mean it",
    "example": "That concert was amazing fr fr.",
    "origin": "Internet slang abbreviation"
  },
  {
    "question": "What is 'Gyat'? How to pronounce it and when to use it?",
    "term": "Gyat",
    "meaning": "Expression of surprise or admiration, often about appearance",
    "usage": "Exclamation when seeing something impressive",
    "example": "GYAT! That car is insane!",
    "origin": "Shortened from 'goddamn', popularized by streamers"
  },
  {
    "question": "What is 'Sigma'? How to pronounce it and when to use it?",
    "term": "Sigma",
    "meaning": "Independent, self-reliant person; lone wolf mentality",
    "usage": "Describing someone who operates alone and doesn't follow the pack",
    "example": "He's on his sigma grindset, doesn't need anyone's approval.",
    "origin": "From 'sigma male' internet meme culture"
  },
  {
    "question": "What is 'Cheem'? How to pronounce it and when to use it?",
    "term": "Cheem",
    "meaning": "Silly, ridiculous, or absurd in a funny way",
    "usage": "Used to mock something that's over-the-top or goofy",
    "example": "He put ketchup on his ice cream? That's cheem.",
    "origin": "Meme culture, popularized on TikTok"
  },
  {
    "question": "What is 'Big Mood'? How to pronounce it and when to use it?",
    "term": "Big Mood",
    "meaning": "Relatable feeling or situation; when something perfectly sums up your current vibe",
    "usage": "To express strong agreement or shared emotion",
    "example": "Staying in bed all day after a long week? Big mood.",
    "origin": "Internet slang, popular on Twitter and TikTok"
  },
  {
    "question": "What is 'Sus'? How to pronounce it and when to use it?",
    "term": "Sus",
    "meaning": "Suspicious or shady behavior",
    "usage": "Calling out someone or something that seems off",
    "example": "He said he finished the assignment in 5 minutes… sus.",
    "origin": "From Among Us game slang, exploded on TikTok"
  },
  {
    "question": "What is 'Goblin Mode'? How to pronounce it and when to use it?",
    "term": "Goblin Mode",
    "meaning": "Fully embracing laziness, messiness, or indulgence",
    "usage": "When someone unapologetically acts lazy or unbothered",
    "example": "Spent the whole weekend in goblin mode watching Netflix and eating chips.",
    "origin": "Internet slang, exploded on TikTok/Reddit 2022–2023"
  },
  {
    "question": "What is 'Main Character Energy'? How to pronounce it and when to use it?",
    "term": "Main Character Energy",
    "meaning": "Acting like the protagonist of your own life; confident and unapologetically yourself",
    "usage": "To hype someone's vibe or presence",
    "example": "She walked into the party with main character energy, everyone noticed.",
    "origin": "TikTok, 2023–2024 trend"
  },
  {
    "question": "What is 'Cheugy'? How to pronounce it and when to use it?",
    "term": "Cheugy",
    "meaning": "Out of date, trying too hard, or unfashionable, especially in a basic way",
    "usage": "When something or someone is a little behind current trends",
    "example": "Wearing UGG boots in 2025? That's so cheugy.",
    "origin": "TikTok/Instagram slang, popularized in 2021"
  },
  {
    "question": "What is 'Hits Different'? How to pronounce it and when to use it?",
    "term": "Hits Different",
    "meaning": "Something feels stronger, more impactful, or just special compared to the usual",
    "usage": "To describe experiences, music, or emotions that stand out",
    "example": "Listening to this old song now… hits different fr fr.",
    "origin": "Social media slang, widely used on TikTok"
  },
  {
    "question": "What is 'Bet'? How to pronounce it and when to use it?",
    "term": "Bet",
    "meaning": "Affirmative agreement or challenge; like saying 'okay' or 'watch me'",
    "usage": "To accept a plan or confirm understanding",
    "example": "You'll finish that project by tonight? Bet.",
    "origin": "African American Vernacular English (AAVE), popularized on Twitter/TikTok"
  },
  {
    "question": "What is 'Sheesh'? How to pronounce it and when to use it?",
    "term": "Sheesh",
    "meaning": "Expression of amazement, hype, or approval",
    "usage": "Usually elongated for effect: 'Sheeeesh!'",
    "example": "He just pulled off that insane trick—sheeeesh!",
    "origin": "TikTok/Gen-Z slang, often paired with the ice-in-hand gesture"
  },
  {
    "question": "What is 'FYP'? How to pronounce it and when to use it?",
    "term": "FYP",
    "meaning": "'For You Page' on TikTok; often used to tag content you hope will go viral",
    "usage": "Can also reference something trending or relatable",
    "example": "This dance is straight up FYP energy.",
    "origin": "TikTok terminology, from its recommendation algorithm"
  },
  {
    "question": "What is 'Iykyk'? How to pronounce it and when to use it?",
    "term": "Iykyk",
    "meaning": "If you know, you know; something only certain people will understand",
    "usage": "Used for inside jokes, references, or experiences that only specific people get",
    "example": "That inside joke from last night? Iykyk.",
    "origin": "Internet slang abbreviation, popularized on social media"
  },
  {
    "question": "What is 'Mid'? How to pronounce it and when to use it?",
    "term": "Mid",
    "meaning": "Average, underwhelming, not great but not terrible",
    "usage": "To describe something that's mediocre or disappointing",
    "example": "That movie everyone hyped was so mid.",
    "origin": "Internet slang, popularized on TikTok and Twitter"
  },
  {
    "question": "What is 'Touch Grass'? How to pronounce it and when to use it?",
    "term": "Touch Grass",
    "meaning": "Go outside, get real, stop being too online",
    "usage": "Telling someone to disconnect from the internet and experience real life",
    "example": "You're arguing over Minecraft skins — go touch grass.",
    "origin": "Internet slang, popularized on Reddit and Twitter"
  }
]

