[
  {
    "question": "What is 'Ethereal'? How to pronounce it and when to use it?",
    "word": "Ethereal",
    "meaning": "Extremely delicate and light; heavenly or spiritual",
    "example": "The ethereal beauty of the northern lights left us speechless.",
    "pronunciation": "ih-THEER-ee-uhl"
  },
  {
    "question": "What is 'Serendipity'? How to pronounce it and when to use it?",
    "word": "Serendipity",
    "meaning": "Finding something good without looking for it; a happy accident",
    "example": "It was pure serendipity that we met at the coffee shop that day.",
    "pronunciation": "ser-en-DIP-ih-tee"
  },
  {
    "question": "What is 'Ephemeral'? How to pronounce it and when to use it?",
    "word": "Ephemeral",
    "meaning": "Lasting for a very short time; fleeting",
    "example": "The beauty of cherry blossoms is ephemeral, lasting only about two weeks.",
    "pronunciation": "ih-FEM-er-uhl"
  },
  {
    "question": "What is 'Eloquent'? How to pronounce it and when to use it?",
    "word": "Eloquent",
    "meaning": "Fluent or persuasive in speaking or writing",
    "example": "Her eloquent speech moved the entire audience to tears.",
    "pronunciation": "EL-uh-kwent"
  },
  {
    "question": "What is 'Ubiquitous'? How to pronounce it and when to use it?",
    "word": "Ubiquitous",
    "meaning": "Present, appearing, or found everywhere",
    "example": "Smartphones have become ubiquitous in modern society.",
    "pronunciation": "yoo-BIK-wih-tus"
  },
  {
    "question": "What is 'Resilient'? How to pronounce it and when to use it?",
    "word": "Resilient",
    "meaning": "Able to withstand or recover quickly from difficult conditions",
    "example": "Despite all the challenges, she remained resilient and kept pushing forward.",
    "pronunciation": "rih-ZIL-yent"
  },
  {
    "question": "What is 'Ambiguous'? How to pronounce it and when to use it?",
    "word": "Ambiguous",
    "meaning": "Open to more than one interpretation; not having one obvious meaning",
    "example": "The ambiguous ending of the movie left viewers debating its true meaning.",
    "pronunciation": "am-BIG-yoo-us"
  },
  {
    "question": "What is 'Benevolent'? How to pronounce it and when to use it?",
    "word": "Benevolent",
    "meaning": "Well meaning and kindly; showing goodwill",
    "example": "The benevolent stranger donated thousands to the local charity.",
    "pronunciation": "buh-NEV-uh-lent"
  },
  {
    "question": "What is 'Cacophony'? How to pronounce it and when to use it?",
    "word": "Cacophony",
    "meaning": "A harsh, discordant mixture of sounds",
    "example": "The cacophony of car horns and construction noise made it hard to concentrate.",
    "pronunciation": "kuh-KOF-uh-nee"
  },
  {
    "question": "What is 'Diligent'? How to pronounce it and when to use it?",
    "word": "Diligent",
    "meaning": "Having or showing care and conscientiousness in one's work or duties",
    "example": "Her diligent study habits helped her achieve straight A's.",
    "pronunciation": "DIL-ih-jent"
  },
  {
    "question": "What does 'logophile' mean? How to pronounce it and when to use it?",
    "word": "logophile",
    "meaning": "A person who loves words.",
    "example": "As a true logophile, she carried a dictionary everywhere.",
    "pronunciation": "/ˈlɒg.ə.faɪl/ — phonetic: log-uh-file"
  },
  {
    "question": "What does 'ineffable' mean? How to pronounce it and when to use it?",
    "word": "ineffable",
    "meaning": "Too great or extreme to be expressed in words.",
    "example": "The beauty of the sunset was ineffable.",
    "pronunciation": "/ɪˈnɛf.ə.bəl/ — phonetic: in-ef-uh-buhl"
  },
  {
    "question": "What does 'prevaricator' mean? How to pronounce it and when to use it?",
    "word": "prevaricator",
    "meaning": "Someone who avoids telling the truth; a liar.",
    "example": "The politician was known as a prevaricator during interviews.",
    "pronunciation": "/prɪˈvær.ɪ.keɪ.tər/ — phonetic: pri-var-i-kay-tor"
  },
  {
    "question": "What does 'trepidator' mean? How to pronounce it and when to use it?",
    "word": "trepidator",
    "meaning": "A person who feels or causes fear or anxiety (rare word form of 'trepidation').",
    "example": "The trepidator warned everyone of the approaching storm.",
    "pronunciation": "/trɛp.ɪˈdeɪ.tər/ — phonetic: trep-i-day-tor"
  },
  {
    "question": "What does 'liberally' mean? How to pronounce it and when to use it?",
    "word": "liberally",
    "meaning": "Generously or freely.",
    "example": "She sprinkled the herbs liberally over the pasta.",
    "pronunciation": "/ˈlɪb.ər.əl.i/ — phonetic: lib-er-uh-lee"
  },
  {
    "question": "What does 'astute' mean? How to pronounce it and when to use it?",
    "word": "astute",
    "meaning": "Having sharp judgment; quick to notice or understand things",
    "example": "She made an astute observation about how the design could be improved.",
    "pronunciation": "uh-STOOT"
  },
  {
    "question": "What does 'conscientious' mean? How to pronounce it and when to use it?",
    "word": "conscientious",
    "meaning": "Careful, responsible, and doing your work with attention and honesty",
    "example": "He's a conscientious student who always double-checks his work.",
    "pronunciation": "kon-shee-EN-shus"
  },
  {
    "question": "What does 'articulate' mean? How to pronounce it and when to use it?",
    "word": "articulate",
    "meaning": "Able to express yourself clearly and effectively",
    "example": "She's very articulate when she explains her ideas.",
    "pronunciation": "ar-TIK-yuh-lit"
  },
  {
    "question": "What does 'meticulous' mean? How to pronounce it and when to use it?",
    "word": "meticulous",
    "meaning": "Extremely careful and precise about details",
    "example": "He's meticulous with his code — not a single bug slips through.",
    "pronunciation": "muh-TIK-yuh-lus"
  },
  {
    "question": "What does 'resilient' mean? How to pronounce it and when to use it?",
    "word": "resilient",
    "meaning": "Able to recover quickly from difficulties",
    "example": "She stayed resilient after failing her first exam.",
    "pronunciation": "rih-ZIL-yent"
  },
  {
    "question": "What does 'eloquent' mean? How to pronounce it and when to use it?",
    "word": "eloquent",
    "meaning": "Speaking or writing in a graceful, persuasive way",
    "example": "His speech was so eloquent that everyone stopped to listen.",
    "pronunciation": "EL-uh-kwent"
  },
  {
    "question": "What does 'pragmatic' mean? How to pronounce it and when to use it?",
    "word": "pragmatic",
    "meaning": "Practical; focused on what works in real life rather than theory",
    "example": "Let's be pragmatic — we don't have time for perfection, just results.",
    "pronunciation": "prag-MAT-ik"
  },
  {
    "question": "What is 'Voracious'? How to pronounce it and when to use it?",
    "word": "Voracious",
    "meaning": "Having an eager or extremely hungry appetite — for food, knowledge, or activity",
    "example": "She has a voracious appetite for learning new languages.",
    "pronunciation": "voh-RAY-shus"
  },
  {
    "question": "What is 'Zealous'? How to pronounce it and when to use it?",
    "word": "Zealous",
    "meaning": "Showing intense passion or energy for a cause, belief, or goal",
    "example": "The volunteers were zealous in helping the victims of the flood.",
    "pronunciation": "ZEL-us"
  },
  {
    "question": "What is 'Obfuscate'? How to pronounce it and when to use it?",
    "word": "Obfuscate",
    "meaning": "To make something unclear or difficult to understand — often on purpose",
    "example": "The legal document was written to obfuscate rather than clarify.",
    "pronunciation": "OB-fuh-skayt"
  },
  {
    "question": "What is 'Reverberate'? How to pronounce it and when to use it?",
    "word": "Reverberate",
    "meaning": "To echo, resound, or have a lasting impact",
    "example": "His words reverberated in her mind long after the conversation ended.",
    "pronunciation": "rih-VUR-buh-rayt"
  },
  {
    "question": "What is 'Altruistic'? How to pronounce it and when to use it?",
    "word": "Altruistic",
    "meaning": "Showing selfless concern for the well-being of others",
    "example": "Donating half of her salary was an altruistic act.",
    "pronunciation": "al-troo-IS-tik"
  },
  {
    "question": "What is 'Quintessential'? How to pronounce it and when to use it?",
    "word": "Quintessential",
    "meaning": "Representing the most perfect or typical example of something",
    "example": "She is the quintessential leader — calm, smart, and decisive.",
    "pronunciation": "kwin-tuh-SEN-shul"
  },
  {
    "question": "What is 'Melancholy'? How to pronounce it and when to use it?",
    "word": "Melancholy",
    "meaning": "A deep, reflective sadness; thoughtful sorrow",
    "example": "There was a hint of melancholy in his voice as he spoke about the past.",
    "pronunciation": "MEL-un-kol-ee"
  },
  {
    "question": "What is 'Vociferous'? How to pronounce it and when to use it?",
    "word": "Vociferous",
    "meaning": "Expressing opinions or feelings loudly and forcefully",
    "example": "The crowd became vociferous when the referee made a bad call.",
    "pronunciation": "voh-SIF-er-us"
  },
  {
    "question": "What is 'Lethargic'? How to pronounce it and when to use it?",
    "word": "Lethargic",
    "meaning": "Lacking energy; feeling sluggish or drowsy",
    "example": "After the big meal, everyone felt lethargic and ready for a nap.",
    "pronunciation": "luh-THAR-jik"
  },
  {
    "question": "What is 'Fortuitous'? How to pronounce it and when to use it?",
    "word": "Fortuitous",
    "meaning": "Happening by chance, often in a lucky or beneficial way",
    "example": "Their fortuitous meeting led to a lifelong friendship.",
    "pronunciation": "for-TOO-ih-tus"
  },
  {
    "question": "What is 'Semantic'? How to pronounce it and when to use it?",
    "word": "Semantic",
    "meaning": "Relating to meaning in language or logic; concerned with the meaning of words",
    "example": "The semantic difference between 'house' and 'home' is subtle but important.",
    "pronunciation": "sih-MAN-tik"
  },
  {
    "question": "What is 'Adversity'? How to pronounce it and when to use it?",
    "word": "Adversity",
    "meaning": "Difficulties or misfortune; challenging circumstances",
    "example": "She overcame great adversity to achieve her dreams.",
    "pronunciation": "ad-VUR-sih-tee"
  },
  {
    "question": "What is 'Semantic'? How to pronounce it and when to use it?",
    "word": "Semantic",
    "meaning": "Relating to meaning in language or logic; concerned with the meaning of words",
    "example": "The semantic difference between 'house' and 'home' is subtle but important.",
    "pronunciation": "sih-MAN-tik"
  }
]
