[
  {
    "title": "Octopuses have three hearts",
    "summary": "Two pump blood to the gills, while the third pumps it to the rest of the body. Interestingly, when an octopus swims, the heart that delivers blood to the body stops beating, which is why these creatures prefer to crawl rather than swim!",
    "videoLink": "",
    "source": "Nature Documentary"
  },
  {
    "title": "Honey never spoils",
    "summary": "Archaeologists have found 3,000-year-old honey in Egyptian tombs that's still perfectly edible! Honey's low moisture content and acidic pH create an inhospitable environment for bacteria and microorganisms.",
    "videoLink": "",
    "source": "History Channel"
  },
  {
    "title": "Bananas are berries, but strawberries aren't",
    "summary": "Botanically speaking, bananas qualify as berries because they develop from a single flower with one ovary. Strawberries, on the other hand, come from flowers with multiple ovaries, making them 'aggregate fruits,' not true berries.",
    "videoLink": "",
    "source": "Science Explained"
  },
  {
    "title": "The Eiffel Tower can be 15 cm taller in summer",
    "summary": "When a substance is heated, its particles move more and take up more space. The iron structure of the Eiffel Tower expands in hot weather, making it grow taller during summer months.",
    "videoLink": "",
    "source": "Engineering Facts"
  },
  {
    "title": "Sharks existed before trees",
    "summary": "Sharks have been around for about 400 million years, while trees appeared around 350 million years ago. This means sharks are older than trees, Saturn's rings, and even the North Star!",
    "videoLink": "",
    "source": "Prehistoric Earth"
  },
  {
    "title": "Your brain generates electricity",
    "summary": "The human brain operates on the same amount of power as a 10-watt light bulb. Neurons communicate via electrical impulses, and all your thoughts, feelings, and actions are essentially electrical signals.",
    "videoLink": "",
    "source": "Neuroscience Today"
  },
  {
    "title": "There's a planet made of diamonds",
    "summary": "55 Cancri e, a planet twice the size of Earth, is believed to be largely made of carbon in the form of diamond and graphite. Its estimated value is around $26.9 nonillion!",
    "videoLink": "",
    "source": "Space Facts"
  },
  {
    "title": "Cleopatra lived closer to the Moon landing than the pyramids",
    "summary": "Cleopatra lived around 30 BC, while the Great Pyramid of Giza was built around 2560 BC. The Moon landing happened in 1969 AD. This means Cleopatra lived about 2,530 years after the pyramids but only 1,999 years before the Moon landing!",
    "videoLink": "",
    "source": "History Perspective"
  },
  {
    "title": "Water can boil and freeze at the same time",
    "summary": "This is called the 'triple point,' and it occurs when temperature and pressure are just right for all three phases (gas, liquid, and solid) to coexist in equilibrium.",
    "videoLink": "",
    "source": "Physics Explained"
  },
  {
    "title": "The shortest war in history lasted 38 minutes",
    "summary": "The Anglo-Zanzibar War of 1896 is recorded as the shortest war in history, lasting between 38 and 45 minutes. British forces quickly overwhelmed the Sultan of Zanzibar's palace.",
    "videoLink": "",
    "source": "Military History"
  },
  {
    "title": "What do pronunciation marks and symbols mean in other languages?",
    "summary": "Pronunciation marks like •``••▪︎ are diacritical marks that change how letters are pronounced. Examples: • (dot) can indicate stress or nasalization, `` (grave accent) changes vowel sounds, •• (diaeresis) separates vowel sounds, ▪︎ (square) can mark tone or emphasis. These marks help non-native speakers pronounce words correctly and are essential for proper communication in languages like French (é, è, ê), German (ä, ö, ü), Spanish (ñ, á, é), and many others.",
    "videoLink": "",
    "source": "Linguistics Explained"
  }
]

